app/views/teams/_form.html.erb

SELECT "tournaments".* FROM "tournaments"
---
    <%= f.label :tournament %><br />
    <%= collection_select(:team, :tournament_id, Tournament.all, :id, :name, :prompt => "None") %>